# Operações

Há muitas operações com pandas que serão realmente úteis para você, mas não se enquadram em nenhuma categoria distinta. Vamos mostrar aqui nesta aula:

In [5]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Informação sobre valores exclusivos

In [2]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [3]:
df['col2'].nunique()

3

In [4]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

### Selecionando dados

In [5]:
# Selecione do DataFrame usando critérios de várias colunas
newdf = df[(df['col1']>2) & (df['col2']==444)]

In [6]:
newdf

   col1  col2 col3
3     4   444  xyz

### Aplicando funções

In [7]:
def times2(x):
    return x*2

In [8]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [9]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [10]:
df['col1'].sum()

10

** Removendo colunas permanentemente **

In [11]:
del df['col1']

In [12]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

** Obter nomes de coluna e índice: **

In [13]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [14]:
df.index

RangeIndex(start=0, stop=4, step=1)

** Ordenando um DataFrame **

In [15]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [16]:
df.sort_values(by='col2') #inplace=False por padrão

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

** Encontre Valores Nulos ou Verifique Valores Nulos **

In [17]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [18]:
# Deleta linhas com valores NaN
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

** Preenchendo os valores de NaN com outra coisa: **

In [19]:
import numpy as np

In [20]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [21]:
df.fillna('Preencher')

        col1       col2 col3
0          1  Preencher  abc
1          2        555  def
2          3        666  ghi
3  Preencher        444  xyz

In [22]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [23]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [24]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

## Dropna

DataFrame.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False) [Link](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html)

Retorna um novo dataframe sem as linhas que possuem dados faltantes (NaN)

In [6]:
dados = {
    'nome': ['João', 'Maria', 'José', np.nan, 'Pedro', 'Judas', 'Tiago'],
    'sexo': ['M', 'F', 'M', np.nan, 'M', 'M', np.nan],
    'idade': [14, 13, np.nan, np.nan, 15, 13, 14],
    'nota': [4, 10, 7, np.nan, 8, 9, 7]
}
df = pd.DataFrame(dados)

In [7]:
df

    nome sexo  idade  nota
0   João    M   14.0   4.0
1  Maria    F   13.0  10.0
2   José    M    NaN   7.0
3    NaN  NaN    NaN   NaN
4  Pedro    M   15.0   8.0
5  Judas    M   13.0   9.0
6  Tiago  NaN   14.0   7.0

In [8]:
# omite todas linhas onde qualquer registro contiver dados faltantes
df.dropna(how='any') # ou simplesmente df.dropna()

    nome sexo  idade  nota
0   João    M   14.0   4.0
1  Maria    F   13.0  10.0
4  Pedro    M   15.0   8.0
5  Judas    M   13.0   9.0

In [9]:
# retorna um novo dataframe, onde todas as colunas da linha são NaN
df.dropna(how='all')

    nome sexo  idade  nota
0   João    M   14.0   4.0
1  Maria    F   13.0  10.0
2   José    M    NaN   7.0
4  Pedro    M   15.0   8.0
5  Judas    M   13.0   9.0
6  Tiago  NaN   14.0   7.0

In [10]:
df['serie'] = np.nan # cria uma nova coluna sem dados

In [11]:
df

    nome sexo  idade  nota  serie
0   João    M   14.0   4.0    NaN
1  Maria    F   13.0  10.0    NaN
2   José    M    NaN   7.0    NaN
3    NaN  NaN    NaN   NaN    NaN
4  Pedro    M   15.0   8.0    NaN
5  Judas    M   13.0   9.0    NaN
6  Tiago  NaN   14.0   7.0    NaN

In [12]:
df.dropna(how='all', axis=1) # retorna um novo dataframe, onde todos os registros da coluna (axis=1) são NaN

    nome sexo  idade  nota
0   João    M   14.0   4.0
1  Maria    F   13.0  10.0
2   José    M    NaN   7.0
3    NaN  NaN    NaN   NaN
4  Pedro    M   15.0   8.0
5  Judas    M   13.0   9.0
6  Tiago  NaN   14.0   7.0

In [13]:
df.dropna(thresh=1) # retira as linhas onde mais de x informações nas colunas forem NaN (thresh=x)

    nome sexo  idade  nota  serie
0   João    M   14.0   4.0    NaN
1  Maria    F   13.0  10.0    NaN
2   José    M    NaN   7.0    NaN
4  Pedro    M   15.0   8.0    NaN
5  Judas    M   13.0   9.0    NaN
6  Tiago  NaN   14.0   7.0    NaN

In [17]:
# o inplace altera o dataframe atual, onde os valores da coluna serie forem vazios
df['serie'].fillna(8, inplace=True)

In [18]:
df

    nome sexo  idade  nota  serie
0   João    M   14.0   4.0    8.0
1  Maria    F   13.0  10.0    8.0
2   José    M    NaN   7.0    8.0
3    NaN  NaN    NaN   NaN    8.0
4  Pedro    M   15.0   8.0    8.0
5  Judas    M   13.0   9.0    8.0
6  Tiago  NaN   14.0   7.0    8.0

In [19]:
df['serie'] = np.nan # zerando de novo

In [20]:
df['idade'].fillna(0, inplace=True) # preenche com zeros onde não há valores
df['idade'].mean() # calcula média da coluna

9.857142857142858

In [21]:
df

    nome sexo  idade  nota  serie
0   João    M   14.0   4.0    NaN
1  Maria    F   13.0  10.0    NaN
2   José    M    0.0   7.0    NaN
3    NaN  NaN    0.0   NaN    NaN
4  Pedro    M   15.0   8.0    NaN
5  Judas    M   13.0   9.0    NaN
6  Tiago  NaN   14.0   7.0    NaN

In [22]:
df[df['nome'].notnull()] # retorna as linhas não vazias da coluna nome

    nome sexo  idade  nota  serie
0   João    M   14.0   4.0    NaN
1  Maria    F   13.0  10.0    NaN
2   José    M    0.0   7.0    NaN
4  Pedro    M   15.0   8.0    NaN
5  Judas    M   13.0   9.0    NaN
6  Tiago  NaN   14.0   7.0    NaN

In [23]:
df[df['nome'].notnull() & df['sexo'].notnull()] # retorna as linhas não vazias da coluna nome E sexo

    nome sexo  idade  nota  serie
0   João    M   14.0   4.0    NaN
1  Maria    F   13.0  10.0    NaN
2   José    M    0.0   7.0    NaN
4  Pedro    M   15.0   8.0    NaN
5  Judas    M   13.0   9.0    NaN

## Dados ausentes

Vamos mostrar alguns métodos convenientes para lidar com Missing Data em pandas:

In [24]:
df2 = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [25]:
df2

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [26]:
df2.dropna() # Mostra

     A    B  C
0  1.0  5.0  1

In [27]:
df2.dropna(axis=1)

   C
0  1
1  2
2  3

In [28]:
df2.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [29]:
df2.fillna(value='Vazio')

       A      B  C
0      1      5  1
1      2  Vazio  2
2  Vazio  Vazio  3

In [30]:
df2['A'].fillna(value=df2['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64